:PROPERTIES:
:ID:       9794fa8b-585d-426f-8dac-de49a25496ec
:END:
#+title: Higher-Dimensional Files
#+filetags: Idea
* What's Wrong with POSIX?

A POSIX file system is (logically) a tree whose (i)nodes are sequences of content bytes plus a miniscule amount of metadata, and whose edges represent containment. What are the semantics of this tree in practice?

#+begin_src shell

  ls /

#+end_src

#+RESULTS:
| bin        |
| boot       |
| dev        |
| etc        |
| gnu        |
| home       |
| lost+found |
| mnt        |
| proc       |
| root       |
| run        |
| sys        |
| tmp        |
| usr        |
| var        |


#+begin_src shell

  ls /dev | head -20

#+end_src

#+RESULTS:
| autofs          |
| block           |
| bsg             |
| btrfs-control   |
| bus             |
| cdrom           |
| char            |
| console         |
| core            |
| cpu_dma_latency |
| cuse            |
| disk            |
| dri             |
| ecryptfs        |
| fb0             |
| fd              |
| full            |
| fuse            |
| hidraw0         |
| hidraw1         |
...


It seems that people have come to use directories as tags, the directory =/dev= being a "tag" for device files, =/tmp= for temporary files, =/home= for user home directories, etc. However, a tree is /not/ the natural data structure associated with tagging systems. Instead, that'd be an arbitrary concept lattice. These are sufficiently different structures, in general, that it's hard to effectively translate between one and the other, resulting in a large amount of functionality that doesn't "cleanly" fit anywhere---the =/etc= directory witnesses this. Moreover, the features that serve to ameliorate some of the difference are seldom-used aberrations, namely, links, which allow data to have multiple properties in something other than a direct line of inheritance.

Furthermore, the actual /contents/ of the files have no structure enforced by the filesystem. The extra metadata stored with each (i)node in the tree enforces differences between formats of stored data more or less only when it is required to perform syscalls, for instance if a file cannot be read at an arbitrary index (perhaps an input device file). The problem with this state of affairs is evident to any enjoyer of strongly-typed programming languages: it requires runtime checks and validation of file contents, it's harder to reason about (and therefore automate) file relationships at a system level, &c.

Why, then, did Thompson and Ritchie accept this problem? What did they do to mitigate it?

Well, in the first case, both because solving it contrasted with their aims, and because the contemporary cures were /far/ worse than the disease. UNIX was written by developers, for developers, on machines with approximately zero resources, to be as simple as possible. Accordingly, its authors chose to solve problems with the cleanest, fastest, and smallest implementation, with ease-of-use left as an exercise for the user---he would be a programmer, after all, so he no doubt could understand documentation and roll something to suit his needs. Furthermore, database file systems, analogous to this tags-based approach, were the status quo at the time, and working with them was horrendous. Anyone who has the misfortune of needing to interact with COBOL or fixed-format FORTRAN in current year knows the agony of old record formatting schemes; these file systems were little more than the extension of those schemes to every file in the system. This failure seems to be attributable to the brittleness of the type system imposed; modern knowledge about what makes a nice type system for programming languages should be applicable to designing a type system for files.

To the second question, the saving grace was userspace utilities that remain the /apotheosis/ of performing and composing text manipulation: the shell, grep, awk, sed, ed, lex, yacc, and friends. If one cannot look to the system to guarantee the properties of data, then one had better be able to recognize and massage that data yourself. These are a large part of what has enabled UNIX and its derivatives to dominate computation for 50 years. However, it's still a mitigation. Preferred would be a solution.

